@rsalmond I have tried using two versions of the provider. In both cases, the field `delete_contents_on_destroy` were set to `false` when this field in the HCL was commented. 
I also tried by applying with v2.20.0 first and then un-commenting the line and re-applying with new version, v3.10. No error was caught. Can you post your full debug log and the state files before and after the change if you are still able to repro this issue? Thank you
 
```
2020-02-27T11:50:09.473-0800 [DEBUG] plugin.terraform-provider-google_v2.20.2_x4: 2020/02/27 11:50:09 [INFO] Instantiating Google Cloud Storage Transfer client for path https://storagetransfer.googleapis.com/
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.foo will be created
  + resource "google_bigquery_dataset" "foo" {
      + creation_time              = (known after apply)
      + dataset_id                 = "foo"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + id                         = (known after apply)
```
```
2020-02-27T11:59:03.489-0800 [DEBUG] plugin.terraform-provider-google_v3.10.0_x4: plugin 

Terraform will perform the following actions:

  # google_bigquery_dataset.foo will be created
  + resource "google_bigquery_dataset" "foo" {
      + creation_time              = (known after apply)
      + dataset_id                 = "foo"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
```